In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

joining

In [2]:
df1=pd.DataFrame({"col1":[1,4,7],"col2":[2,5,8]})

In [3]:
df1

   col1  col2
0     1     2
1     4     5
2     7     8

In [4]:
df2=pd.DataFrame({"col3":[1,4,7],"col4":[2,5,9]},index=[0,1,3])

In [5]:
df2

   col3  col4
0     1     2
1     4     5
3     7     9

In [6]:
df1.join(df2)

   col1  col2  col3  col4
0     1     2   1.0   2.0
1     4     5   4.0   5.0
2     7     8   NaN   NaN

In [7]:
df1.join(df2,how="left")

   col1  col2  col3  col4
0     1     2   1.0   2.0
1     4     5   4.0   5.0
2     7     8   NaN   NaN

In [8]:
df3=df1.join(df2,how="right")
df3

   col1  col2  col3  col4
0   1.0   2.0     1     2
1   4.0   5.0     4     5
3   NaN   NaN     7     9

In [9]:
type(df1)

pandas.core.frame.DataFrame

In [10]:
type(df3.col1.values[2])   #nan is basically a float value

numpy.float64

In [11]:
df1.join(df2,how="outer")

   col1  col2  col3  col4
0   1.0   2.0   1.0   2.0
1   4.0   5.0   4.0   5.0
2   7.0   8.0   NaN   NaN
3   NaN   NaN   7.0   9.0

In [12]:
df1.join(df2,how="inner")

   col1  col2  col3  col4
0     1     2     1     2
1     4     5     4     5

# Data input and output using pandas

In [18]:
df=pd.DataFrame({"a":[0,4,8,12],"b":[1,5,9,13],"c":[2,6,10,14],"d":[3,7,11,15]})

In [20]:
df  #csv files pd.read_csv("xyz.csv")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

df.to_csv("filename",index=False)

tsv files have tabs in between columns. read them saying read_tsv("example.tsv",sep="\t") gives tab spaces between values

excel files : pd.read_excel("Excel_Sample.xlsx",sheet_name="Sheet1")
    
            df.to_excel("......",sheet_name=' ')

HTML- df2=pd.read_html("xyz.html",header=0)  #reads tables from html pages  #header=0 means the 1st row is taken as header.
df2[0]  #prints 1st table in page

In [25]:
#import re
#df2[0]["Unnamed: 1"].apply(lambda x:re.sub("\[d\]",'',str(x))) substituting values in between [] by empty string